Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: Note that the Google framework prints a warning at the end of the test execution if there are any disabled tests, as shown in Listing 7.
it_it: Notare che il framework di Google stampa un warning al termine dell'esecuzione del test se sono presenti test disabilitati, come mostrato nel Listato 7.

source: Note that the error messages must go to std::cerr and not std::cout.
it_it: Notare che i messaggi di errore devono andare a std::cerr e non a std::cout.

source: Note that the mock class doesn't define AppendPacket(), unlike the real class.
it_it: Notare che la classe mock non definisce AppendPacket(), come la classe reale.

source: Note that the mock class doesn't define `AppendPacket()`, unlike the real class.
it_it: Notare che la classe mock non definisce `AppendPacket()`, come la classe reale.

source: Note that the order of the two EXPECT_CALLs is important, as a newer EXPECT_CALL takes precedence over an older one.
it_it: Notare che l'ordine dei due EXPECT_CALL è importante, poiché un EXPECT_CALL più recente ha la precedenza su quello precedente.

source: Note that the order of the two `EXPECT_CALL`s is important, as a newer `EXPECT_CALL` takes precedence over an older one.
it_it: Notare che l'ordine dei due `EXPECT_CALL` è importante, poiché un `EXPECT_CALL` più recente ha la precedenza su quello precedente.

source: Note that the piece of code under test can be a compound statement, for example:
it_it: Notare che la parte di codice da testare può essere un'istruzione composta, ad esempio:

source: Note that the predicate function / functor doesn't have to return bool.
it_it: Notare che la funzione/funtore del predicato non deve restituire bool.

source: Note that the predicate function / functor doesn't have to return `bool`.
it_it: Notare che la funzione/funtore del predicato non deve restituire `bool`.

source: Note that the support for move-only method arguments was only introduced to gMock in April 2017; in older code, you may find more complex workarounds for lack of this feature.
it_it: Notare che il supporto per gli argomenti move-only di metodi è stato introdotto in gMock solo nell'aprile 2017; nel codice più vecchio si trovano dei workaround più complessi per la mancanza di questa funzionalità.

source: Note that the support for move-only method arguments was only introduced to gMock in April 2017; in older code, you may find more complex [workarounds](#LegacyMoveOnly) for lack of this feature.
it_it: Notare che il supporto per gli argomenti move-only di metodi è stato introdotto in gMock solo nell'aprile 2017; nel codice più vecchio si trovano dei [workarounds](#LegacyMoveOnly) più complessi per la mancanza di questa funzionalità.

source: Note that the two are separated by a comma (,), not a period (.).
it_it: Si noti che i due sono separati da una virgola (,), non da un punto (.).

source: Note that the two are separated by a comma (`,`), not a period (`.`).
it_it: Si noti che i due sono separati da una virgola (`,`), non da un punto (`.`).

source: Note that the values 5.0 and string("Hi") are
it_it: Notare che i valori 5.0 e string("Hi") sono

source: Note that we are talking about the *top-level* `const` modifier here.
it_it: Si noti che qui stiamo parlando del modificatore *top-level* `const`.

source: Note that we are talking about the top-level const modifier here.
it_it: Si noti che qui stiamo parlando del modificatore top-level const.

source: Note that we have to pick different suffixes (Action, ActionP, ActionP2, and etc) for actions with different numbers of value parameters, or the action definitions cannot be overloaded on the number of them.
it_it: Notare che dobbiamo scegliere suffissi diversi (Action, ActionP, ActionP2, ecc.) per azioni con numeri diversi di parametri valore, oppure non si possono avere overload delle definizioni delle azioni rispetto al loro numero.

source: Note that we have to pick different suffixes (`Action`, `ActionP`, `ActionP2`, and etc) for actions with different numbers of value parameters, or the action definitions cannot be overloaded on the number of them.
it_it: Notare che dobbiamo scegliere suffissi diversi (`Action`, `ActionP`, `ActionP2`, ecc.) per azioni con numeri diversi di parametri valore, oppure non si possono avere overload delle definizioni delle azioni rispetto al loro numero.

source: Note that wrapping a return or argument type with parentheses is, in general, invalid C++.
it_it: Si noti che racchiudere un tipo di ritorno o un tipo di un argomento tra le parentesi non è, in generale, sbagliato in C++.

source: Note that you **cannot** use `IgnoreResult()` on an action that already returns `void`.
it_it: Notare che **non si può** usare `IgnoreResult()` su un'azione che restituisce già `void`.

source: Note that you cannot use IgnoreResult() on an action that already returns void.
it_it: Notare che non si può usare IgnoreResult() su un'azione che restituisce già void.

source: Note that you don't need to provide the type of the parameter either.
it_it: Notare che non è necessario fornire nemmeno il tipo del parametro.

source: Note that you don't need to specify the types of the mock function arguments.
it_it: Notare che non è necessario specificare i tipi degli argomenti della funzione mock.

source: Note that:
it_it: Notare che:

source: Note the return type.
it_it: Notare il tipo restituito.

source: Note, however, that if you use the ReturnOKWith() method, it will override the values provided by SetArgPointee() in the response parameters of your function call.
it_it: Notare, tuttavia, che se si usa il metodo ReturnOKWith(), esso sovrascriverà [override] i valori forniti da SetArgPointee() nei parametri di risposta della chiamata di funzione.

source: Note, however, that if you use the `ReturnOKWith()` method, it will override the values provided by `SetArgPointee()` in the response parameters of your function call.
it_it: Notare, tuttavia, che se si usa il metodo `ReturnOKWith()`, esso sovrascriverà [override] i valori forniti da `SetArgPointee()` nei parametri di risposta della chiamata di funzione.

source: Notice that the sysroot is not included in libdir and includedir!
it_it: Notare che sysroot non è incluso in libdir e in includedir!

source: Notice that the sysroot is not included in `libdir` and `includedir`!
it_it: Notare che sysroot non è incluso in `libdir` e in `includedir`!

source: Now comes the fun part: you take the function signature, cut-and-paste it into the macro, and add two commas - one between the return type and the name, another between the name and the argument list.
it_it: Ora arriva la parte divertente: si prende la firma [signature] della funzione, la si taglia e la si incolla nella macro e si aggiungono due virgole: una tra il tipo restituito e il nome, un'altra tra il nome e l'elenco degli argomenti.

source: Now it's easy to mock out the function.
it_it: Ora è facile mock-are la funzione.

source: Now let's do a quick quiz to see how well you can use this mock stuff already.
it_it: Ora facciamo un breve quiz per vedere quanto bene si possano già usare queste cose di mock.

source: Now let's look at what this means for TEST and TEST_F.
it_it: Ora vediamo cosa significa per TEST e TEST_F.

source: Now let's look at what this means for `TEST` and `TEST_F`.
it_it: Ora vediamo cosa significa per `TEST` e `TEST_F`.

source: Now that we have the mock class defined, we can use it in tests.
it_it: Ora che abbiamo definito la classe mock, possiamo usarla nei test.

source: Now that you have read the GoogleTest Primer and learned how to write tests using GoogleTest, it's time to learn some new tricks.
it_it: Dopo aver letto la Guida di GoogleTest e imparato a scrivere test utilizzando GoogleTest, è il momento di imparare dei nuovi trucchi.

source: Now that you have read the [GoogleTest Primer](primer.md) and learned how to write tests using GoogleTest, it's time to learn some new tricks.
it_it: Dopo aver letto la [Guida di GoogleTest](primer.md) e imparato a scrivere test utilizzando GoogleTest, è il momento di imparare dei nuovi trucchi.

source: Now that you've created your first basic test, it is time to run it.
it_it: Ora che è stato creato il primo test di base, è il momento di eseguirlo.

source: Now the tricky part: you need to register all test patterns using the REGISTER_TYPED_TEST_SUITE_P macro before you can instantiate them.
it_it: Ora la parte difficile: si devono registrare tutti i pattern dei test utilizzando la macro REGISTER_TYPED_TEST_SUITE_P prima di poterli istanziare.

source: Now the tricky part: you need to register all test patterns using the `REGISTER_TYPED_TEST_SUITE_P` macro before you can instantiate them.
it_it: Ora la parte difficile: si devono registrare tutti i pattern dei test utilizzando la macro `REGISTER_TYPED_TEST_SUITE_P` prima di poterli istanziare.

source: Now we need to mock Buzzer in our tests.
it_it: Ora dobbiamo mock-are Buzzer nei nostri test.

source: Now we can just call Notification::WaitForNotification() in the main thread to wait for the asynchronous call to finish.
it_it: Ora possiamo semplicemente chiamare Notification::WaitForNotification() nel thread principale per attendere il completamento della chiamata asincrona.

source: Now we can just call `Notification::WaitForNotification()` in the main thread to wait for the asynchronous call to finish.
it_it: Ora possiamo semplicemente chiamare `Notification::WaitForNotification()` nel thread principale per attendere il completamento della chiamata asincrona.

source: Now we need to mock `Buzzer` in our tests.
it_it: Ora dobbiamo mock-are `Buzzer` nei nostri test.

source: Now we'll write tests using TEST_F() and this fixture.
it_it: Ora scriveremo i test utilizzando TEST_F() e questa fixture.

source: Now we'll write tests using `TEST_F()` and this fixture.
it_it: Ora scriveremo i test utilizzando `TEST_F()` e questa fixture.

source: Now you can build and run your test:
it_it: Ora si possono buildare ed eseguire il test:

source: Now you want to mock this interface such that you can set expectations on it.
it_it: Ora si vuole creare la mock di questa interfaccia in modo da potervi impostare delle expectation.

source: Now you're ready to build C++ code that uses GoogleTest.
it_it: Ora si è pronti per creare codice C++ che utilizza GoogleTest.

source: Now, if foo.DoThis() is called with a value less than 5, 'a' will be returned; otherwise 'b' will be returned.
it_it: Ora, se foo.DoThis() viene chiamato con un valore inferiore a 5, verrà restituito 'a'; altrimenti verrà restituito 'b'.

source: Now, if `foo.DoThis()` is called with a value less than 5, `'a'` will be returned; otherwise `'b'` will be returned.
it_it: Ora, se `foo.DoThis()` viene chiamato con un valore inferiore a 5, verrà restituito `'a'`; altrimenti verrà restituito `'b'`.

source: Now, if we decompose the DAG into sequences, we just need to know which sequences each EXPECT_CALL() belongs to in order to be able to reconstruct the original DAG.
it_it: Ora, se scomponiamo il DAG in sequenze, dobbiamo solo sapere a quali sequenze appartiene ciascuna EXPECT_CALL() per poter ricostruire il DAG originale.

source: Now, if we decompose the DAG into sequences, we just need to know which sequences each `EXPECT_CALL()` belongs to in order to be able to reconstruct the original DAG.
it_it: Ora, se scomponiamo il DAG in sequenze, dobbiamo solo sapere a quali sequenze appartiene ciascuna `EXPECT_CALL()` per poter ricostruire il DAG originale.

source: Now, judiciously use the right flag to enable gMock serve you better!
it_it: Ora, usare giudiziosamente il flag giusto per consentire a gMock di servire al meglio!

source: Now, since we said that there should be only two such calls, gMock will report an error immediately.
it_it: Ora, poiché abbiamo detto che dovrebbero esserci solo due chiamate di questo tipo, gMock segnalerà immediatamente un errore.

source: Now, sit back and enjoy a completely different output from your tests.
it_it: Ora ci si può rilassare e godersi un risultato completamente diverso dai test.

source: Now, the two TESTs will both generate the same class (Time_Flies_Like_An_Arrow_Test).
it_it: Ora, i due TEST genereranno entrambi la stessa classe Time_Flies_Like_An_Arrow_Test).

source: Now, the two `TEST`s will both generate the same class (`Time_Flies_Like_An_Arrow_Test`).
it_it: Ora, i due `TEST` genereranno entrambi la stessa classe (`Time_Flies_Like_An_Arrow_Test`).

source: Now, when RUN_ALL_TESTS() is called, it first calls the SetUp() method of each environment object, then runs the tests if none of the environments reported fatal failures and GTEST_SKIP() was not called.
it_it: Ora, quando viene chiamato RUN_ALL_TESTS(), prima chiama il metodo SetUp() di ciascun oggetto dell'ambiente, poi esegue i test se nessuno degli ambienti ha riportato errori fatali e GTEST_SKIP() non è stato chiamato.

source: Now, when `RUN_ALL_TESTS()` is called, it first calls the `SetUp()` method of each environment object, then runs the tests if none of the environments reported fatal failures and `GTEST_SKIP()` was not called.
it_it: Ora, quando viene chiamato `RUN_ALL_TESTS()`, prima chiama il metodo `SetUp()` di ciascun oggetto dell'ambiente, poi esegue i test se nessuno degli ambienti ha riportato errori fatali e `GTEST_SKIP()` non è stato chiamato.

source: Now, you can use this polymorphic action the same way you use the built-in ones:
it_it: Ora si può utilizzare questa azione polimorfica nello stesso modo in cui si usano quelle native:

source: Now, your code will no longer be able to ignore RUN_ALL_TESTS() when compiled with gcc.
it_it: Ora il codice non sarà più in grado di ignorare RUN_ALL_TESTS() quando verrà compilato con gcc.

source: Now, your code will no longer be able to ignore `RUN_ALL_TESTS()` when compiled with `gcc`.
it_it: Ora il codice non sarà più in grado di ignorare `RUN_ALL_TESTS()` quando verrà compilato con `gcc`.

source: OR
it_it: O

source: Obvious too, huh?
it_it: Anch'esso ovvio, huh?

source: Obviously turtle.GetY() is expected to be called four times.
it_it: Ovviamente turtle.GetY() ci si aspetta che venga chiamato quattro volte.

source: Obviously `turtle.GetY()` is expected to be called four times.
it_it: Ovviamente `turtle.GetY()` ci si aspetta che venga chiamato quattro volte.

source: Obviously, you can do step #1 without locking.
it_it: Ovviamente si può fare il passo #1 senza il locking.

source: Of course, if you explicitly write a Times(), gMock will not try to infer the cardinality itself.
it_it: Naturalmente, se si scrive esplicitamente un Times(), gMock non tenterà di dedurre la cardinalità.

source: Of course, if you explicitly write a `Times()`, gMock will not try to infer the cardinality itself.
it_it: Naturalmente, se si scrive esplicitamente un `Times()`, gMock non tenterà di dedurre la cardinalità.

source: Often a mock function takes a reference to object as an argument.
it_it: Spesso una funzione mock accetta un riferimento all'oggetto come argomento.

source: Often people want fatal failures to propagate like exceptions.
it_it: Spesso le persone vogliono che i fallimenti fatali si propaghino come le eccezioni.

source: Often people write ON_CALLs in the mock object's constructor or SetUp(), as the default behavior rarely changes from test to test.
it_it: Spesso le persone scrivono ON_CALL nel costruttore dell'oggetto mock o in SetUp(), poiché il comportamento di default raramente cambia da test a test.

source: Often people write `ON_CALL`s in the mock object's constructor or `SetUp()`, as the default behavior rarely changes from test to test.
it_it: Spesso le persone scrivono `ON_CALL` nel costruttore dell'oggetto mock o in `SetUp()`, poiché il comportamento di default raramente cambia da test a test.

source: Often you may find yourself using classes that don't implement interfaces.
it_it: Spesso ci si ritrova a utilizzare classi che non implementano interfacce.

source: Oftentimes you do not want to be too specific.
it_it: Spesso non si vuol essere troppo specifici.

source: Old
it_it: Vecchia

source: Old macros and their new equivalents:
it_it: Le vecchie macro e i loro nuovi equivalenti:

source: Old-Style MOCK_METHODn Macros
it_it: Macro MOCK_METHODn Old-Style

source: Old-Style `MOCK_METHODn` Macros
it_it: Le Macro `MOCK_METHODn` Old-Style

source: On POSIX systems, fork() (or clone() on Linux) is used to spawn the child, after which:
it_it: Sui sistemi POSIX, fork() (o clone() su Linux) viene utilizzato per generare il figlio, dopodiché:

source: On POSIX systems, `fork()` (or `clone()` on Linux) is used to spawn the child, after which:
it_it: Sui sistemi POSIX, `fork()` (o `clone()` su Linux) viene utilizzato per generare il figlio, dopodiché:

source: On Windows, InitGoogleTest() also works with wide strings, so it can be used in programs compiled in UNICODE mode as well.
it_it: Su Windows, InitGoogleTest() funziona anche con stringhe estese [wide], quindi può essere utilizzato anche in programmi compilati in modalità UNICODE.

source: On Windows, GoogleTest uses its own simple regular expression implementation.
it_it: Su Windows, GoogleTest utilizza la propria semplice implementazione di espressioni regolari.

source: On Windows, `InitGoogleTest()` also works with wide strings, so it can be used in programs compiled in `UNICODE` mode as well.
it_it: Su Windows, `InitGoogleTest()` funziona anche con stringhe estese [wide], quindi può essere utilizzato anche in programmi compilati in modalità `UNICODE`.

source: On Windows, the child is spawned using the CreateProcess() API, and re-executes the binary to cause just the single death test under consideration to be run - much like the "threadsafe" mode on POSIX.
it_it: Su Windows, il figlio viene generato [spawn] utilizzando l'API CreateProcess() e riesegue il file binario per causare l'esecuzione del singolo death test in questione, in modo molto simile alla modalità "threadsafe" su POSIX.

source: On Windows, the child is spawned using the `CreateProcess()` API, and re-executes the binary to cause just the single death test under consideration to be run - much like the `"threadsafe"` mode on POSIX.
it_it: Su Windows, il figlio viene generato [spawn] utilizzando l'API `CreateProcess()` e riesegue il file binario per causare l'esecuzione del singolo death test in questione, in modo molto simile alla modalità `"threadsafe"` su POSIX.

source: On each shard, set the GTEST_SHARD_INDEX environment variable to the index of the shard.
it_it: Su ogni shard, si imposta la variabile di ambiente GTEST_SHARD_INDEX sull'indice dello shard.

source: On each shard, set the GTEST_TOTAL_SHARDS environment variable to the total number of shards.
it_it: Su ogni shard, si imposta la variabile di ambiente GTEST_TOTAL_SHARDS sul numero totale di shard.

source: On each shard, set the `GTEST_SHARD_INDEX` environment variable to the index of the shard.
it_it: Su ogni shard, si imposta la variabile di ambiente `GTEST_SHARD_INDEX` sull'indice dello shard.

source: On each shard, set the `GTEST_TOTAL_SHARDS` environment variable to the total number of shards.
it_it: Su ogni shard, si imposta la variabile di ambiente `GTEST_TOTAL_SHARDS` sul numero totale di shard.

source: Once built, you can run them directly and affect their behavior via the following environment variables and/or command line flags.
it_it: Una volta creati, si possono eseguire direttamente e influenzarne il comportamento tramite le seguenti variabili di ambiente e/o flag della riga di comando.

source: Once in a while you'll run into a test whose result is hit-or-miss.
it_it: Di tanto in tanto ci si imbatterà in un test il cui risultato è incostante.

source: Once they are defined, you can instantiate them by including foo_param_test.h, invoking INSTANTIATE_TEST_SUITE_P(), and depending on the library target that contains foo_param_test.cc.
it_it: Una volta definiti, se ne può creare un'istanza includendo foo_param_test.h, richiamando INSTANTIATE_TEST_SUITE_P() e in base alla libreria target che contiene foo_param_test.cc.

source: Once they are defined, you can instantiate them by including `foo_param_test.h`, invoking `INSTANTIATE_TEST_SUITE_P()`, and depending on the library target that contains `foo_param_test.cc`.
it_it: Una volta definiti, se ne può creare un'istanza includendo `foo_param_test.h`, richiamando `INSTANTIATE_TEST_SUITE_P()` e in base alla libreria target che contiene `foo_param_test.cc`.

source: Once threads have been created, it may be difficult or impossible to clean them up.
it_it: Una volta creati i thread, potrebbe essere difficile o impossibile ripulirli.

source: Once you have a mock class, using it is easy.
it_it: Una volta che si ha una classe mock, usarla è facile.

source: Once you have some concrete experience, you can much more easily decide which one to use the next time.
it_it: Una volta acquisita un'esperienza concreta, si potrà decidere molto più facilmente quale utilizzare.

source: One significant advantage of the matcher approach is that matchers can be easily combined to form new matchers, while the EXPECT_NE, etc, macros cannot be easily combined.
it_it: Un vantaggio significativo dell'approccio con i matcher è che questi possono essere facilmente combinati per formare nuovi matcher, mentre le macro EXPECT_NE, ecc, non possono essere facilmente combinate.

source: One correct way of saying that turtle.GetX() will return 10, 20, 30, ..., is to explicitly say that the expectations are not sticky.
it_it: Un modo corretto per dire che turtle.GetX() restituirà 10, 20, 30, ..., è dire esplicitamente che le expectation non sono appiccicose.

source: One correct way of saying that `turtle.GetX()` will return 10, 20, 30, ..., is to explicitly say that the expectations are *not* sticky.
it_it: Un modo corretto per dire che `turtle.GetX()` restituirà 10, 20, 30, ..., è dire esplicitamente che le expectation *non* sono appiccicose.

source: One example is that you have a matcher for long and the argument you want to match is int.
it_it: Un esempio è che si abbia un matcher per long e l'argomento che si vuol trovare è int.

source: One example is that you have a matcher for `long` and the argument you want to match is `int`.
it_it: Un esempio è che si abbia un matcher per `long` e l'argomento che si vuol trovare è `int`.

source: One nice thing about Pointee() is that it treats a NULL pointer as a match failure, so you can write Pointee(m) instead of
it_it: Una cosa bella di Pointee() è che tratta un puntatore NULL come una corrispondenza fallita, quindi si può scrivere Pointee(m) anziché

source: One nice thing about `Pointee()` is that it treats a `NULL` pointer as a match failure, so you can write `Pointee(m)` instead of
it_it: Una cosa bella di `Pointee()` è che tratta un puntatore `NULL` come una corrispondenza fallita, quindi si può scrivere `Pointee(m)` anziché

source: One oft-encountered problem with gMock is that it can be hard to test asynchronous behavior.
it_it: Un problema spesso riscontrato con gMock è che può essere difficile testare il comportamento asincrono.

source: One significant advantage of the matcher approach is that matchers can be easily combined to form new matchers, while the `EXPECT_NE`, etc, macros cannot be easily combined.
it_it: Un vantaggio significativo dell'approccio con i matcher è che questi possono essere facilmente combinati per formare nuovi matcher, mentre le macro `EXPECT_NE`, ecc, non possono essere facilmente combinate.

source: One way to do it is to provide overloaded versions of the function.
it_it: Un modo per farlo è fornire versioni sovraccaricate [overloaded] della funzione.
